doc/site/site.org
#+title: zfs-snap-diff
#+hugo_base_dir: .
#+options: creator:t author:nil

* Installation
  :PROPERTIES:
  :export_file_name: install
  :export_hugo_weight: 20
  :export_hugo_section: docs
  :END:


*** Linux
 TODO

*** FreeBSD
 TODO


*** Build from source

**** ~go~

  - clone this repo: ~git clone -b dev https://github.com/j-keck/zfs-snap-diff~
  - change to the checkout directory: ~cd zfs-snap-diff~
  - build it: ~go build -ldflags="-X main.version=$(git describe)" ./cmd/zfs-snap-diff~

The optional ~-ldflags="-X main.version=$(git describe)"~ flag updates the ~version~ string in the binary.

**** ~nix~

The ~nix~ build also compiles the frontend to javascript and decode it in ~pkg/webapp/bindata.go~.

  - clone this repo: ~git clone -b dev https://github.com/j-keck/zfs-snap-diff~
  - change to the checkout directory: ~cd zfs-snap-diff~
  - build it: ~nix-build -A zfs-snap-diff~

To crosscompile the binary for

  - FreeBSD: ~nix-build -A zfs-snap-diff --argstr goos freebsd~
  - MacOS: ~nix-build -A zfs-snap-diff --argstr goos darwin~
  - Solaris: ~nix-build -A zfs-snap-diff --argstr goos solaris~



